const PATTERN = {
    //强密码的强度必须是包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间。
    passwordPlus: /^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$/, 
    //密码(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)
    passwrod: /^[a-zA-Z]\w{4,17}$/,
    //帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线)
    username: /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/, 
    //字符串仅能是中文。 
    chinese: /^[\\u4e00-\\u9fa5]{0,}$/,
    //E-mail地址合规性的正则检查语句。
    email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/, 
    //手机号码
    phone: /^(13[0-9]|14[0-9]|15[0-9]|166|17[0-9]|18[0-9]|19[8|9])\d{8}$/  
}
export default PATTERN;